In [2]:
#Create a Pandas Series object containing the following data:
#5, 10, 15, 20, 25. What is the average of the values in the Series?
import pandas as p
a = [5,10,15,20,25]
series = p.Series(a)
average = series.mean()
median = series.median()
sum = series.sum()
mode = series.mode()
standarddeviation = series.std()
counts = series.value_counts()
average
#median
#sum
#mode
#standarddeviation
#counts

15.0

In [3]:
#Create a Pandas DataFrame object containing the following data: 
#{'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'Salary': [50000, 60000, 70000]}. What is the total salary of all employees?

my_data = {'Name':['Alice','Bob','Charlie'], 'Age':[25,30,35], 'Salary':[50000,60000,70000]}
df = p.DataFrame(my_data)
df
totalsalary = df['Salary'].sum()
totalsalary
#df['Name']
#df['Age']
#df.describe()
#df[df['Salary'] > 50000]
#df.sort_values('Age', ascending=True)
#df.groupby('Name')['Salary'].sum()

180000

In [91]:
#Create a Pandas Series object containing the following data
#: [1, 2, 3, 4, 5]. Add 10 to each value in the Series.

c = [1,2,3,4,5]
series = p.Series(c)
c_new = series.apply(lambda x: x + 10)
print(c_new)
#series = c_new
#series.describe()
#series.sum()
#series[1]
#series[series > 12]

0    11
1    12
2    13
3    14
4    15
dtype: int64

In [103]:
#Create a Pandas DataFrame object containing the following data: {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'Salary': [50000, 60000, 70000]}.
#Select only the rows where the Age is greater than 30.
data = {'Name':['Alice','Bob','Charlie'], 'Age':[25,30,35], 'Salary':[50000,60000,70000]}
df1 = p.DataFrame(data)
df1
df1[df1['Age'] > 30]
#df1['Name']

      Name  Age  Salary
2  Charlie   35   70000

In [23]:
#Load a CSV file named 'diabetes.csv' into a Pandas DataFrame object. 
#What are the names of the columns in the DataFrame?
Diabetes = p.read_csv('C:/Users/msaim/Downloads/big-bio-data-class-2023/Data/Diabetes/diabetes.csv')
#Diabetes.head()
print(Diabetes.columns)
#Diabetes.iloc[1:3]
#Diabetes.iloc[0]
#Diabetes['Glucose']
#Diabetes['Pregnancy']
#Diabetes[Diabetes['BloodPressure'] > 80].head()

Index(['Pregnancies', 'Glucose', 'BloodPressure', 'SkinThickness', 'Insulin',
       'BMI', 'DiabetesPedigreeFunction', 'Age', 'Outcome'],
      dtype='object')

In [26]:
#Display the dimensions of the data
print(Diabetes.shape)

(768, 9)

In [30]:
#Display the top 10 rows
print(Diabetes.head(10))

   Pregnancies  Glucose  BloodPressure  SkinThickness  Insulin   BMI  \
0            6      148             72             35        0  33.6
1            1       85             66             29        0  26.6
2            8      183             64              0        0  23.3
3            1       89             66             23       94  28.1
4            0      137             40             35      168  43.1
5            5      116             74              0        0  25.6
6            3       78             50             32       88  31.0
7           10      115              0              0        0  35.3
8            2      197             70             45      543  30.5
9            8      125             96              0        0   0.0

   DiabetesPedigreeFunction  Age  Outcome
0                     0.627   50        1
1                     0.351   31        0
2                     0.672   32        1
3                     0.167   21        0
4                     2.288   33        1
5                     0.201   30        0
6                     0.248   26        1
7                     0.134   29        0
8                     0.158   53        1
9                     0.232   54        1

In [31]:
#Display the last 10 rows
Diabetes.tail(10)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
758,1,106,76,0,0,37.5,0.197,26,0
759,6,190,92,0,0,35.5,0.278,66,1
760,2,88,58,26,16,28.4,0.766,22,0
761,9,170,74,31,0,44.0,0.403,43,1
762,9,89,62,0,0,22.5,0.142,33,0
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [52]:
#Create a Pandas DataFrame object containing the following data: 
#{'Name': ['Alice', 'Bob', 'Charlie', 'Dave', 'Eve'], 'Age': [25, 30, None, 35, 40], 'Salary': [50000, None, 70000, 80000, 90000]}.
#Remove all rows with missing values
d = {'Name':['Alice','Bob','Charlie','Dave','Eve'], 'Age': [25,30,None,35,40], 'Salary': [50000,None,70000,80000,90000]}
df2 = p.DataFrame(d)
df2
df2.dropna()
#df2.dropna(subset=['Age'])
#df2['Salary'] = df2['Salary'].replace(50000,20000)
#df2
#df2.fillna(3000000)

    Name   Age   Salary
0  Alice  25.0  50000.0
3   Dave  35.0  80000.0
4    Eve  40.0  90000.0

In [62]:
#Create a Pandas DataFrame object containing the following data: {'Name': ['Alice', 'Bob', 'Charlie', 'Dave', 'Eve'], 'Age': [25, 30, None, 35, 40], 'Salary': [50000, None, 70000, 80000, 90000]}.
#Fill all missing values with the average Age and the median Salary.
b = {'Name':['Alice','Bob','Charlie','Dave','Eve'], 'Age': [25,30,None,35,40], 'Salary': [50000,None,70000,80000,90000]}
df = p.DataFrame(b)
mean_age = df['Age'].mean()
mean_age
median_salary = df['Salary'].median()
median_salary
df.fillna(mean_age)
df.fillna(median_salary)

      Name      Age   Salary
0    Alice     25.0  50000.0
1      Bob     30.0  75000.0
2  Charlie  75000.0  70000.0
3     Dave     35.0  80000.0
4      Eve     40.0  90000.0

In [64]:
#Create a Pandas DataFrame object containing the following data: {'Year': [2019, 2019, 2020, 2020], 'Quarter': ['Q1', 'Q2', 'Q1', 'Q2'], 'Sales': [100, 200, 300, 400]}.
#Pivot the DataFrame so that the rows are indexed by Year, the columns are indexed by Quarter, and the values are the Sales.
x = {'Year': [2019, 2019, 2020, 2020], 'Quarter': ['Q1', 'Q2', 'Q1', 'Q2'], 'Sales': [100, 200, 300, 400]}
y = p.DataFrame(x)
y
y_new = y.pivot(index='Year', columns='Quarter', values='Sales')
y_new

Quarter   Q1   Q2
Year
2019     100  200
2020     300  400